In [7]:
import numpy as np
import pandas as pd

In [162]:
date = np.array('2012-06-04', dtype=np.datetime64)
date

array('2012-06-04', dtype='datetime64[D]')

In [163]:
# index = date + np.arange(4)
index = ['2012-06-04', '2012-06-04', '2012-06-05', '2012-06-06']
dataset = np.random.randint(10, size=[4,4])

In [164]:
data = pd.DataFrame(dataset, 
                    index = index, columns=['one', 'two', 'three', 'four'])

In [165]:
data

            one  two  three  four
2012-06-04    7    6      6     7
2012-06-04    4    5      4     6
2012-06-05    2    8      3     8
2012-06-06    2    6      3     6

In [166]:
# data.index = pd.DatetimeIndex(data.index)
data.index = pd.to_datetime(data.index)

In [167]:
data.index

DatetimeIndex(['2012-06-04', '2012-06-04', '2012-06-05', '2012-06-06'], dtype='datetime64[ns]', freq=None)

In [168]:
data.reset_index()

       index  one  two  three  four
0 2012-06-04    7    6      6     7
1 2012-06-04    4    5      4     6
2 2012-06-05    2    8      3     8
3 2012-06-06    2    6      3     6

In [169]:
data.index

DatetimeIndex(['2012-06-04', '2012-06-04', '2012-06-05', '2012-06-06'], dtype='datetime64[ns]', freq=None)

In [170]:
data.iloc[[3]]

            one  two  three  four
2012-06-06    2    6      3     6

In [171]:
data['2012-06-04':'2012-06-04']

            one  two  three  four
2012-06-04    7    6      6     7
2012-06-04    4    5      4     6

In [172]:
data['2012']

            one  two  three  four
2012-06-04    7    6      6     7
2012-06-04    4    5      4     6
2012-06-05    2    8      3     8
2012-06-06    2    6      3     6

In [173]:
data.iloc[[1]]

            one  two  three  four
2012-06-04    4    5      4     6

In [174]:
data[['two', 'three']]

            two  three
2012-06-04    6      6
2012-06-04    5      4
2012-06-05    8      3
2012-06-06    6      3

In [33]:
index3 = pd.MultiIndex.from_arrays([['FR', 'SWE', 'FR', 'SWE'], ['2012-06-04', '2012-06-04', '2012-06-05', '2012-06-06']])
dataset3 = np.random.randint(10, size=[4,4])

In [34]:
data3 = pd.DataFrame(dataset3, 
                    index = index3, columns=['one', 'two', 'three', 'four'])

In [35]:
data3

                one  two  three  four
FR  2012-06-04    0    1      3     8
SWE 2012-06-04    1    5      2     7
FR  2012-06-05    7    0      8     8
SWE 2012-06-06    2    6      3     3

In [36]:
data3.loc['FR']

            one  two  three  four
2012-06-04    0    1      3     8
2012-06-05    7    0      8     8

In [37]:
data3.loc[('FR','2012-06-04')]

one      0
two      1
three    3
four     8
Name: (FR, 2012-06-04), dtype: int64

In [38]:
index3

MultiIndex([( 'FR', '2012-06-04'),
            ('SWE', '2012-06-04'),
            ( 'FR', '2012-06-05'),
            ('SWE', '2012-06-06')],
           )

In [40]:
index3.values

array([('FR', '2012-06-04'), ('SWE', '2012-06-04'), ('FR', '2012-06-05'),
       ('SWE', '2012-06-06')], dtype=object)

In [41]:
index3.codes

FrozenList([[0, 1, 0, 1], [0, 0, 1, 2]])

In [42]:
data3.index

MultiIndex([( 'FR', '2012-06-04'),
            ('SWE', '2012-06-04'),
            ( 'FR', '2012-06-05'),
            ('SWE', '2012-06-06')],
           )

In [44]:
data3.index.names = ['Country', 'Date']

In [47]:
data3.index.columns = 'Season'

In [48]:
data3

                    one  two  three  four
Country Date
FR      2012-06-04    0    1      3     8
SWE     2012-06-04    1    5      2     7
FR      2012-06-05    7    0      8     8
SWE     2012-06-06    2    6      3     3

In [50]:
data3.index.columns

'Season'

In [56]:
data3.stack()

Country  Date
FR       2012-06-04  one      0
                     two      1
                     three    3
                     four     8
SWE      2012-06-04  one      1
                     two      5
                     three    2
                     four     7
FR       2012-06-05  one      7
                     two      0
                     three    8
                     four     8
SWE      2012-06-06  one      2
                     two      6
                     three    3
                     four     3
dtype: int64